<?php
    $p1 = "가위";
    $p2 = rand(0, 2);


    if ($p1 == "가위")
    {
        if ($p2 == 0)
        {
            $g = "비김";
            $p2 = "가위";
        }
        else if ($p2 == 1)
        {
            $g = "패배";
            $p2 = "바위";
        }
        else
        {
            $g = "승리";
            $p2 = "보";
        }
    } 
    else if ($p1 == "바위") 
    {
        if ($p2 == 0)
        {
            $g = "승리";
            $p2 = "가위";
        }
        else if ($p2 == 1)
        {
            $g = "비김";
            $p2 = "바위";
        }
        else
        {
            $g = "패배";
            $p2 = "보";
        }
    } 
    else if ($p1 == "보") 
    {
        if ($p2 == 0)
        {
            $g = "패배";
            $p2 = "가위";
        }
        else if ($p2 == 1)
        {
            $g = "승리";
            $p2 = "바위";
        }
        else
        {
            $g = "비김";
            $p2 = "보";
        }
    }
    else
    {
        $g = "가위, 바위, 보 중에 입력하세요.";
        $p2 = " ";
    }

    echo "결과:$g 나:$p1 상대:$p2";

    // echo "\n";


    // $p1 = "가위";
    // $p2 = rand(0, 2);


    // if ($p1 == "가위")
    // {
    //     $p1_n = 0;
    // }
    // else if ($p1 == "바위")
    // {
    //     $p1_n = 1;
    // }
    // else if ($p1 == "보")
    // {
    //     $p1_n = 2;
    // }
    // else
    // {
    //     $p1_n = 5;
    // }

    // if ($p2 == 0)
    // {
    //     $p2_t = "가위";
    // }
    // else if ($p2 == 1)
    // {
    //     $p2_t = "바위";
    // }
    // else
    // {
    //     $p2_t = "보";
    // }

    // if ($p1_n - $p2 == -2 || $p1_n - $p2 == 1)
    // {
    //     $g = "승리";
    // }
    // else if ($p1_n - $p2 == -1 || $p1_n - $p2 == 2)
    // {
    //     $g = "패배";
    // }
    // else if ($p1_n - $p2 == 0)
    // {
    //     $g = "비김";
    // }
    // else
    // {
    //     $g = "가위, 바위, 보 중에 입력하세요.";
    // }

    // echo "결과:$g 나:$p1 상대:$p2_t";
?>
